A little bit more debugging data that might be useful.

If we go to the terraform workspace created by provider ( can be found in the debugging output)

```
cd /var/folders/sx/0tlfb9ys20bbqnszv3lw12m40000gn/T/1c5973e7-c613-4f7c-911e-32b0410e23c8
```

and run terraform there, we will observe that terraform CLI also fails independently 

```
terraform plan
aws_cognito_user_pool_client.example: Refreshing state...

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: reading Amazon Cognito IDP (Identity Provider) User Pool Client ()
│
│   with aws_cognito_user_pool_client.example,
│   on main.tf.json line 1, in resource.aws_cognito_user_pool_client.example:
│    1: {"provider":{"aws":{"access_key":"nope","region":"us-west-1","secret_key":"nope","token":""}},"resource":{"aws_cognito_user_pool_client":{"example":{"lifecycle":{"prevent_destroy":true},"name":"example","user_pool_id":"us-west-1_dMnICLKVB"}}},"terraform":{"required_providers":{"aws":{"source":"hashicorp/aws","version":"4.67.0"}}}}
│
│ InvalidParameter: 1 validation error(s) found.
│ - minimum field size of 1, DescribeUserPoolClientInput.ClientId.
│
```

Checking `main.tf.json` we will not find `id` there, so it is not part of the main arguments input

```
cat main.tf.json
{"provider":{"aws":{"access_key":"nope","region":"us-west-1","secret_key":"nope","token":""}},"resource":{"aws_cognito_user_pool_client":{"example":{"lifecycle":{"prevent_destroy":true},"name":"example","user_pool_id":"us-west-1_dMnICLKVB"}}},"terraform":{"required_providers":{"aws":{"source":"hashicorp/aws","version":"4.67.0"}}}}%
```

If we check `terraform.tfstate` that is constructed by provider, we will find empty `id` exactly there. 

```
cat terraform.tfstate
{"version":4,"terraform_version":"1.2.1","serial":1,"lineage":"1c5973e7-c613-4f7c-911e-32b0410e23c8","outputs":null,"resources":[{"mode":"managed","type":"aws_cognito_user_pool_client","name":"example","provider":"provider[\"registry.terraform.io/hashicorp/aws\"]","instances":[{"schema_version":0,"attributes":{"id":"","name":"example","user_pool_id":"us-west-1_dMnICLKVB"}}]}]}%
```

Notice `"id":""` in the `attributes`

If we remove the state with

```
rm terraform.tfstate
```

the terraform plan will pass the validation and will be able to create new `user_pool_client`

```
terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cognito_user_pool_client.example will be created
  + resource "aws_cognito_user_pool_client" "example" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = (known after apply)
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "example"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = "us-west-1_dMnICLKVB"
      + write_attributes                              = (known after apply)
    }
```

So finding a way to correctly populate empty `id` within the state is a good vector for long-term fix investigation.